var RulesBox = React.createClass({
  render: function() {
    return (
      <div className="mainBox">        
        <b>Кланова війна це найголовніша діяльність клану. </b>

<h4><b>Мета кланової війни:</b></h4>
<br />
Забезпечити перемогу у клановій війні.
<br />
Набрати максимальну к-сть очків досвіду клану. Очки досвіду клану підсилюють увесь клан 
шляхом досягнення вищого рівня клану.
<br />
Навчання учасників клану грі.
<h4><b>
НЕ є метою кланової війни:
</b></h4>
<br />
Збір ресурсів
<br />
Задоволення особистих амбіцій.
<br />
<b>КВ поділяються на адміністровані та неадміністорвані</b>

Адміністрована кв проводиться лідером, колідером або тимчасовим колідером, що згоден її 

адмініструвати. Включає в себе облік: к-сть атака, к-сть зірок, та порушення по кожному учаснику 

кв.
<br />
Неадміністорвана кв ніяким чином не контролюється і  її результати не мають ніяких 

адміністративних наслідків. Проводиться тимчасовими колідерами які не згодні адмініструвати кВ.
<br />
Керує клановою війною керівник кланової війни:
<br />
у планових війна – колідер або старшина, якому це делегував колір ер
<br />
у непланових війнах – колідер або старшина, що зголосився її проводити за згоди керівництва 

клану. Для цього достатньо згоди одного колідера за відсутності заперечень інших колідерів.
<br />
<b>Функція керівника клановою війною:</b>
<br />
Забезпечення досягнення мети кланової 
<br />
Розподіл мішеней для атаки, їх облік та інформування про них
<br />
Організація надання підмоги в захист та атаку
<br />
Вирішення поточних питань кланової війни та конфліктних ситуацій
<br />
Організація учасників клану
<br />
Облік досягнень та порушень гравців
<br />
Надання порад гравцям
<br />
Функція помічника у клановій війні допомагати керівнику кланової війни за його прямими 

вказівками
<br />
Графік проведення кланових воєн:
<br />
Планова – четвер близько 20.00
<br />
Непланові  - за бажання гравців, але так, щоб не суперечити плановій війні.
<br />
Бажана к-сть кланових воєн на тиждень  - 3.
<br />
Участь у плановій клановій війні обов’язкова. 
<br />
Гравець, що не може брати участь у клановій війні повинен позначити себе як неактивного 

(червоним). Тривалий чи безпідставний пропуск планової кланової війни є підставою до 

застосування санкцій до гравця, включаючи видалення з клану.
<br />
Участь у неплановій війні є добровільною та здійснюється за записом. 
<br />
Запис на непланову війну проводиться у чаті та на форумі. 
<br />
Інформування про кланову війну здійснюється клановою поштою та на форумі клану.
<br />
Якщо кількість учасників кланової війни є некратною 5, то вона доводиться до такої керівником 

кланової війни шляхом включення «червоних» гравців з найвищим рівнем особистого досвіду.
<br />
Якщо неможливо довести к-сть учасників кланової війни до кратної 5 за рахунок «червоних» 

гравців, це досягається шляхом не включення гравців з найменшим особистим досвідом.
<br />
При цьому «червоні» гравці не зобов’язані здійснювати атаки і не несуть за це відповідальності. 
<br />
Підмога на кланову війну є обов’язком усіх учасників кланової війни. Розподіл (вирішення хто 

кому що має дати) визначається керівником кланової війни. При цьому керівник кланової війни не 

може призначати іншим учасникам кв роздати більше підмоги ніж він сам. Гравець за згоди 

керівника кВ може добровільно роздати підмогу за інших.
<br />
<b>Дисципліна кланової війни вимагає безумовного виконання директив керівника кланової війни.</b>
<br />
Гравці зобов’язуються виконати 2 атаки.
<br />
Гравці зобов’язуються виконати атаки на мішені узгоджені з керівником чи помічниками керівника 

кланової війни.
<br />
Гравці зобов’язуються здійснювати атаки незалежно до особистої ресурсної вигоди.
<br />
За узгодженням з керівником кланової війни чи його помічниками можливий самовідвід від 

складних атак у зв’язку із ресурсними обмеженнями гравця:
<br />
Якщо немає ресурсів
<br />
Якщо йде збір ресурсів на будівництво важливої споруди
<br />
Проте такі повторювані дії можуть стати підставою для дисциплінарних висновків з боку 

керівництва клану.
<br />
Гравці зобов’язуються докладати усіх зусиль для отримання максимального результату у клановій 

війні та окремій атаці.
<br />
Гравці зобов’язуються атакувати виключно за умов отримання повного підкріплення, окрім 

випадків, коли результат досягається і без нього.
<br />
<b>Організація кланової війни</b>
<br />
До початку кланової війни керівник кланової війни повинен через чат, кланову розсилку та форум 

клану надати інформацію щодо правил проведення конкретної війни:
<br />
<b>Час початку т проміжки запису на атаку</b>
<br />
На виконання першої атаки надається 12 годин від початку стадії війни. Протягом цього часу за 

гравцем зберігається виключне право на атаку вказаної мішені.
<br />
Друга атака може бути погоджена керівником кланової війни після проведення першої атаки за 

рішенням керівника або одразу або після перших 12 годин стадії війни.
<br />
На виконання другої атаки надається 10 годин (бронь знімається за 2 години до завершення 

кланової війни).
<br />
В останні 2 годин здійснюються резервні атаки.   
      </div>
    );
  }
});


React.render(<RulesBox />, document.getElementById('rulesNode'));